In [1]:
import pandas as pd

In [4]:
data = pd.Series([10,20,30,40,50])
print(data)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Age": [25, 30, 35, 40, 22],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix"],
    "Salary": [50000, 60000, 75000, 80000, 45000]
}
df = pd.DataFrame(data)
print(data)

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'], 'Age': [25, 30, 35, 40, 22], 'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'], 'Salary': [50000, 60000, 75000, 80000, 45000]}

In [7]:
data_list = [
    ["Alice", 25, "New York", 50000],
    ["Bob", 30, "Los Angeles", 60000],
    ["Charlie", 35, "Chicago", 75000],
]
df = pd.DataFrame(data_list,columns = ["Name", "Age", "City", "Salary"])
print(df)

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   75000

In [11]:
df_csv = pd.read_csv(r"C:\Users\ajays\Downloads\countries.csv")
print(df_csv.head())

   id country_code    country_name
0   1           AF     Afghanistan
1   2           AX   Aland Islands
2   3           AL         Albania
3   4           DZ         Algeria
4   5           AS  American Samoa

In [15]:
df_excel = pd.read_excel(r"C:\Users\ajays\Downloads\archive (2)\HR_Employee_Data.xlsx") 
print(df_excel.head())

     Emp_Id  satisfaction_level  last_evaluation  number_project  \
0  IND02438                0.38             0.53               2
1  IND28133                0.80             0.86               5
2  IND07164                0.11             0.88               7
3  IND30478                0.72             0.87               5
4  IND24003                0.37             0.52               2

   average_montly_hours  time_spend_company  Work_accident  left  \
0                   157                   3              0     1
1                   262                   6              0     1
2                   272                   4              0     1
3                   223                   5              0     1
4                   159                   3              0     1

   promotion_last_5years Department  salary
0                      0      sales     low
1                      0      sales  medium
2                      0      sales  medium
3                      0      sales     low
4                      0      sales     low

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
 3   Salary  3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes

In [17]:
df.describe()

        Age        Salary
count   3.0      3.000000
mean   30.0  61666.666667
std     5.0  12583.057392
min    25.0  50000.000000
25%    27.5  55000.000000
50%    30.0  60000.000000
75%    32.5  67500.000000
max    35.0  75000.000000

In [19]:
df.shape

(3, 4)

In [20]:
df.tail(3)

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   75000

In [21]:
df.sample(2) # Random 2 rows

    Name  Age         City  Salary
0  Alice   25     New York   50000
1    Bob   30  Los Angeles   60000

In [22]:
df.isnull().sum() # Count of missing values per column

Name      0
Age       0
City      0
Salary    0
dtype: int64